#Область ПрограммныйИнтерфейс
//////////////////////////////////////////////////////
// Функция для отчета ВКМ_РасходЗапланированныхОтпусков
// В функцию передается четырехзначное Число: ГГГГ
// Возвращаеься дата: 31.12.ГГГГ 23:59:59
//////////////////////////////////////////////////////	
//@skip-check doc-comment-export-function-return-section
Функция ЧислоВКонецГода(Число) Экспорт
	 Возврат ОбщегоНазначенияКлиентСервер.СтрокаВДату(СтрШаблон("31.12.%1 23:59:59",Формат(Число,"ЧГ=")));
КонецФункции	

#КонецОбласти