


&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент) 
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ОтпускВДнях(ТекущиеДанные);
    ЦветовоеОформлениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускВДнях(Строка)
//	Строка.Больше28 = Ложь;
	Строка.Дни = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала )) /( 60*60*24);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ОтпускВДнях(ТекущиеДанные);
   	ЦветовоеОформлениеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЦветовоеОформлениеНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ЦветовоеОформлениеНаСервере()   

	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
	Тз.Свернуть("Сотрудник", "Дни");
	Отбор = Новый Структура;
	Для Каждого Строка Из ТЗ Цикл
		Если Строка.Дни > 28 Тогда 
			Отбор.Вставить("Сотрудник", Строка.Сотрудник);
		КонецЕсли;
	КонецЦикла;  
	Для Каждого Сотрудник Из Объект.ОтпускаСотрудников Цикл
		Сотрудник.Больше28=Ложь;
	КонецЦикла;	
	Если ЗначениеЗаполнено(Отбор) Тогда
		Набор = Объект.ОтпускаСотрудников.НайтиСтроки(Отбор);
		Для Каждого Отпускник из Набор Цикл
			Отпускник.Больше28=Истина;
		КонецЦикла;
	КонецЕсли
КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()  
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
КонецФункции

&НаКлиенте
Процедура АнализГрафика(Команда)
	Адрес=АнализГрафикаНаСервере(); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Год", Объект.Год);
	ПараметрыФормы.Вставить("Адрес", Адрес);

	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры



