


&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент) 
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ОтпускВДнях(ТекущиеДанные);
    ЦветовоеОформлениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускВДнях(Строка)
	
	Строка.Дни = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала )) /( 60*60*24);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ОтпускВДнях(ТекущиеДанные);
   	ЦветовоеОформлениеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЦветовоеОформлениеНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ЦветовоеОформлениеНаСервере()
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
	Тз.Свернуть("Сотрудник", "Дни");
	Для Каждого Строка Из ТЗ Цикл
		Если Строка.Дни > 28 Тогда 
			
			// Цвет раскраски строк
			ЦветОформление = УсловноеОформление.Элементы.Добавить();     
			ЦветОформление.Использование = Истина; 
			ЦветОформление.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.ТусклоРозовый);
			
			// Условия раскраски
			ЭлементОформления = ЦветОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			// Поле реквизита формы
			ЭлементОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
			ЭлементОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОформления.ПравоеЗначение = Строка.Сотрудник;
			
			// Определение табличной части для раскраски
			ЦветПоле = ЦветОформление.Поля.Элементы.Добавить();
			// Имя поля таблицы
			ЦветПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");        
			
			// Определение табличной части для раскраски
			ЦветПоле = ЦветОформление.Поля.Элементы.Добавить();
			// Имя поля таблицы
			ЦветПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковНомерСтроки");    
			
			// Определение табличной части для раскраски
			ЦветПоле = ЦветОформление.Поля.Элементы.Добавить();
			// Имя поля таблицы
			ЦветПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДни");        
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()  
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
КонецФункции

&НаКлиенте
Процедура АнализГрафика(Команда)
	Адрес=АнализГрафикаНаСервере(); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Год", Объект.Год);
	ПараметрыФормы.Вставить("Адрес", Адрес);

	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры



