

Функция ДлительноеСозданиеРеализаций(Дата) Экспорт
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_ДатаокончанияДействияДоговора >= &НачалоПериодаРасчета
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &КонецПериодаРасчета
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК СсылкаНаРеализацию,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &МесяцРеализации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Ссылка КАК Ссылка,
		|	ВТ_Договоры.Организация КАК Организация,
		|	ВТ_Договоры.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ВТ_Реализации.СсылкаНаРеализацию, НЕОПРЕДЕЛЕНО) КАК СсылкаНаРеализацию
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
		|		ПО ВТ_Договоры.Ссылка = ВТ_Реализации.Договор";  
	
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("МесяцРеализации", Месяц(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РезультатТЗ = Новый ТаблицаЗначений;
	РезультатТз.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	РезультатТз.Колонки.Добавить("РеализацияТоваровУслуг", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
	
		Если Не ВыборкаДетальныеЗаписи.СсылкаНаРеализацию = Неопределено Тогда
			ДокументРеализация = ВыборкаДетальныеЗаписи.СсылкаНаРеализацию.ПолучитьОбъект();
			ДокументРеализация.ВыполнитьАвтозаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение); 
	    Иначе	
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
			ДокументРеализация.Заполнить(Неопределено);
			ДокументРеализация.Дата = КонецМесяца(Дата);  
			ДокументРеализация.Договор = ВыборкаДетальныеЗаписи.Ссылка;
			ДокументРеализация.Организация = ВыборкаДетальныеЗаписи.Организация;  
			ДокументРеализация.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			ДокументРеализация.ВыполнитьАвтозаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение); 
		КонецЕсли;
		 
		Запись = РезультатТЗ.Добавить();
		Запись.Договор = ВыборкаДетальныеЗаписи.Ссылка;
		Запись.РеализацияТоваровУслуг =  ДокументРеализация.Ссылка;   
	КонецЦикла;

	Возврат РезультатТЗ; 
		 

КонецФункции	