

Функция ДлительноеСозданиеРеализаций(Дата) Экспорт
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_ДатаокончанияДействияДоговора >= &НачалоПериодаРасчета
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &КонецПериодаРасчета
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РезультатТЗ = Новый ТаблицаЗначений;
	РезультатТз.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	РезультатТз.Колонки.Добавить("РеализацияТоваровУслуг", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &НачалоПериода
		|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
		|	И РеализацияТоваровУслуг.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", ВыборкаДетальныеЗаписи.Ссылка);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода",  НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ДокументРеализация = Выборка.Ссылка;
	    Иначе	
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
			ДокументРеализация.Заполнить(Неопределено);
			ДокументРеализация.Дата = КонецМесяца(Дата);  
			ДокументРеализация.Договор = ВыборкаДетальныеЗаписи.Ссылка;
			ДокументРеализация.Организация = ВыборкаДетальныеЗаписи.Организация;  
			ДокументРеализация.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			ДокументРеализация.ВыполнитьАвтозаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение); 
		КонецЕсли;
		 
		Запись = РезультатТЗ.Добавить();
		Запись.Договор = ВыборкаДетальныеЗаписи.Ссылка;
		Запись.РеализацияТоваровУслуг =  ДокументРеализация.Ссылка;   
	КонецЦикла;

	Возврат РезультатТЗ; 
		 
     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		 
		 
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции	