

&НаСервере
Процедура ОбновитьДиаграммуГанта(Адрес, Год)
	НачалоГода = ОбщегоНазначенияКлиентСервер.СтрокаВДату(СтрШаблон("01.01.%1",Формат(Год,"ЧГ=")));  
	КонецГода = ОбщегоНазначенияКлиентСервер.СтрокаВДату(СтрШаблон("31.12.%1",Формат(Год,"ЧГ=")));
	
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода, КонецГода);
	
	Диаграмма.Очистить();
	
	ТД = ПолучитьИзВременногоХранилища(Адрес); 	
	Серия = Диаграмма.УстановитьСерию("Отпуск");
	
	Для Каждого Отпускник Из ТД Цикл
		
		Точка = Диаграмма.УстановитьТочку(Отпускник.Сотрудник);
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Отпускник.ДатаНачала;
		Интервал.Конец = Отпускник.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 

	ОбновитьДиаграммуГанта(Параметры.Адрес, Параметры.Год)
КонецПроцедуры
