
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//++Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата  
	ЭлементыДляАбонентскихДоговоровСервер();
	//--Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата
КонецПроцедуры

//++Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата  
&НаСервере
Процедура ЭлементыДляАбонентскихДоговоровСервер()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		Если Элементы.Найти("НачалоДействияДоговора")<> Неопределено Тогда
            Элементы.НачалоДействияДоговора.Видимость = Истина;
			Элементы.ОкончаниеДействияДоговора.Видимость = Истина;
			Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
			Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		Иначе	
			ПолеВвода = Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"));
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
			
			ПолеВвода = Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"));
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора"; 
			
			ПолеВвода = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";   
			
			ПолеВвода = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы"; 
		КонецЕсли;
	Иначе
		Если Элементы.Найти("НачалоДействияДоговора")<> Неопределено Тогда
			Элементы.НачалоДействияДоговора.Видимость = Ложь;
			Элементы.ОкончаниеДействияДоговора.Видимость = Ложь;
			Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
			Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
//--Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата  

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//++Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата  
	ЭлементыДляАбонентскихДоговоровСервер();
	//--Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата
КонецПроцедуры
