
&НаСервере
Функция СоздатьРеализацииЗаМесяцНаСервере(Дата)  

	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.ДлительноеСозданиеРеализаций", Дата);
	Возврат ДлительнаяОперация; 
	 //////ДлительноеСозданиеРеализаций(Дата);
	 
КонецФункции

&НаКлиенте
Процедура СоздатьРеализацииЗаМесяц(Команда) 
	ОчиститьСообщения();
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо задать дату, для указания месяца создания документов!",,,"Объект.Дата");
		Возврат;
	КонецЕсли;	
	ДлительнаяОперация = СоздатьРеализацииЗаМесяцНаСервере(Объект.Дата);  
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 1;
	
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
	 //////СоздатьРеализацииЗаМесяцНаСервере(Объект.Дата); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	Если Результат.Статус = "Выполнено" Тогда   
		ОповещениеОЗавершенииФрагмент(Результат.АдресРезультата);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОповещениеОЗавершенииФрагмент(Адрес) 
	ТБ = ПолучитьИзВременногоХранилища(Адрес);
	Для Каждого Строка Из ТБ Цикл
		НоваяСтрока =РезультатРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);  
	КонецЦикла;	
КонецПроцедуры
	    

